lvx/base/DataProcessors/бит_ПолучениеДанныхРегистровБухгалтерии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_ПолучениеДанныхРегистровБухгалтерии</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектСистемы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СпособыКомпоновкиИсточниковДанных</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_ИсточникиДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПулаПодключений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_мпд_НастройкиПуловПодключений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимСообщений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументЗаполнения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОперацияБух</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_ОперацияБюджетирование</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_ОперацияУправленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СозданныеОбъекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выполнять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СозданныйОбъект</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ОперацияБух</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_ОперацияБюджетирование</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_ОперацияУправленческий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

lvx/base/Documents/бит_ОперацияБюджетирование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_ОперацияБюджетирование</Name>
			<Comment>(БИТ)</Comment>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.бит_Бюджетирование</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_СценарииПланирования</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОперацииСценарий</Name>
					<Comment>Сумма операции (сценарий)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОперацииРегл</Name>
					<Comment>Сумма операции (регл)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОперацииУпр</Name>
					<Comment>Сумма операции (упр)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь, ответственный за заполнение данного  (документа)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Comment>Содержание</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСторно</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗапрашиваемыеПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Comment>Имя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Comment>Представление</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>Значение</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

lvx/base/Documents/бит_ОперацияУправленческий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_ОперацияУправленческий</Name>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.бит_Дополнительный_4</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоБюджетам</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_3</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_1</xr:Item>
				<xr:Item>AccumulationRegister.бит_СоответствиеОборотовТрансляции</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоТипамПроводок</xr:Item>
				<xr:Item>AccountingRegister.бит_Бюджетирование</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_5</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_2</xr:Item>
				<xr:Item>InformationRegister.бит_СоответствиеЗаписейТрансляции</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РегистрБухгалтерии</Name>
					<Comment>Имя регистра бухгалтерии</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОперацииРегл</Name>
					<Comment>Сумма операции (регл)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОперацииУпр</Name>
					<Comment>Сумма операции (упр)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОперацииМУ</Name>
					<Comment>Сумма операции (МСФО)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Comment>Содержание</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь, ответственный за заполнение данного документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПроводок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыПроводок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСторно</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

lvx/base/DataProcessors/бит_ПолучениеДанныхРегистровБухгалтерии/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ЗаполнениеОсновнойТаблицыДанных

Функция ПолучитьДанные(ДанныеОбъекта, ДанныеФормы) Экспорт
	
	ИсточникДанных 			 = ДанныеОбъекта.ИсточникДанных;
	Период					 = ДанныеОбъекта.Период;
	НастройкаПулаПодключений = ДанныеОбъекта.НастройкаПулаПодключений;
	
	ОтборВОтчете	 = ДанныеФормы.ОтборВОтчете;
	ТаблицаПараметры = ДанныеФормы.ТаблицаПараметры;
	
	ГраницаНач = Период.ДатаНачала;
	ГраницаКон = Новый Граница(Период.ДатаОкончания, ВидГраницы.Включая);
	
	ПараметрыЗапроса = бит_МеханизмПолученияДанных.ЗаполнитьСтруктуруПараметровИзТаблицы(ТаблицаПараметры);	
	
	Если ТипЗнч(ИсточникДанных) = Тип("СправочникСсылка.бит_ИсточникиДанных") Тогда
		
		// Получим таблицу с данными по источнику данных.
		ПараметрыПередачи = бит_МеханизмПолученияДанных.НовыеПараметрыПолучитьДанныеПоИсточнику();
		ПараметрыПередачи.НастройкаПулаПодключений = НастройкаПулаПодключений;
		ПараметрыПередачи.Параметры                = ПараметрыЗапроса;
		ПараметрыПередачи.ОтборВОтчете             = ОтборВОтчете;
		
		ТаблицаРезультат = бит_МеханизмПолученияДанных.ПолучитьДанныеПоИсточнику(ИсточникДанных,
							ГраницаНач, ГраницаКон, ПараметрыПередачи);
	Иначе
		
		ПоказыватьИндикатор = НЕ бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("НеОтображатьИндикаторКомпоновкиИсточников");
		// Получим таблицу с данными по способу компоновки источников данных.
        ПараметрыПередачи = бит_МеханизмПолученияДанных.НовыеПараметрыПолучитьДанныеПоСпособуКомпоновки();
		ПараметрыПередачи.НастройкаПулаПодключений = НастройкаПулаПодключений;
		ПараметрыПередачи.Параметры                = ПараметрыЗапроса;		
		ПараметрыПередачи.ОтборВОтчете             = ОтборВОтчете;
		ПараметрыПередачи.ПоказыватьИндикатор      = ПоказыватьИндикатор;
		
		ТаблицаРезультат = бит_МеханизмПолученияДанных.ПолучитьДанныеПоИсточникам(ИсточникДанных,
							ГраницаНач, ГраницаКон, ПараметрыПередачи);
																			
		бит_МеханизмПолученияДанных.ДополнитьРезультатИВыполнитьРасчет(ИсточникДанных, ТаблицаРезультат);
		
	КонецЕсли;
		
	Возврат ТаблицаРезультат;
	
КонецФункции

#КонецОбласти
 
#Область СозданиеДокументов
	
// Процедура заполняет движения операции по данным, полученным из источника.
// 
// Параметры:
//  ХранилищеДанные    - ТаблицаЗначений ИЛИ ХранилищеЗначений.
//  НаборЗаписей 	   - НаборЗаписей.<ИмяРегистраБухгалтерии>.
//  КоличествоСубконто - Число.
//  ИмяРегистра		   - Строка (По умолчанию = Неопределено)
// 						(Необезательный, если ХранилищеДанные типа ТаблицаЗначений 
// 						и НаборЗаписей типа НаборЗаписей.<ИмяРегистраБухгалтерии>).
// 
Процедура ЗаполнитьДвижения(ХранилищеДанные, НаборЗаписей, КоличествоСубконто, ИмяРегистра = Неопределено)  Экспорт
	
	// Данные заполнения - таблица значений  	
	Если ТипЗнч(ХранилищеДанные) = Тип("ТаблицаЗначений") Тогда
		ДанныеЗаполнения = ХранилищеДанные;
	Иначе                                  		
		ДанныеЗаполнения = бит_ОбщегоНазначения.РаспаковатьТаблицуЗначений(ХранилищеДанные);
	КонецЕсли;
	
	// Активность проводок
	Активность = ?(НаборЗаписей.Количество() > 0, НаборЗаписей[0].Активность, Истина);	
	
	Для каждого СтрокаДанные Из ДанныеЗаполнения Цикл
		
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, СтрокаДанные);
		Запись.Активность = Активность;
						
		// Заполнение субконто
		Для Ном = 1 По КоличествоСубконто Цикл
			ЗначениеАналитикиДт = СтрокаДанные["СубконтоДт" + Ном];
			ЗначениеАналитикиКт = СтрокаДанные["СубконтоКт" + Ном];
			
			бит_му_ОбщегоНазначения.УстановитьСубконто(Запись.СчетДт, Запись.СубконтоДт, Ном, ЗначениеАналитикиДт);
			бит_му_ОбщегоНазначения.УстановитьСубконто(Запись.СчетКт, Запись.СубконтоКт, Ном, ЗначениеАналитикиКт);
		КонецЦикла;
	КонецЦикла; // ЗначениеВыбора.Данные
	          
КонецПроцедуры // ЗаполнитьДвижения()

// Процедура заполняет движения операции по данным, полученным из источника.
// 
// Параметры:
//  ХранилищеДанные    - ТаблицаЗначений ИЛИ ХранилищеЗначений.
//  НаборЗаписей 	   - ДанныеФормыСтруктураСКоллекцией.
//  КоличествоСубконто - Число.
// 
Процедура ЗаполнитьДвиженияХоз(ХранилищеДанные, НаборЗаписей, КоличествоСубконто)  Экспорт
	
	// Данные заполнения - таблица значений  	
	Если ТипЗнч(ХранилищеДанные) = Тип("ТаблицаЗначений") Тогда
		ДанныеЗаполнения = ХранилищеДанные;
	Иначе                                  		
		ДанныеЗаполнения = бит_ОбщегоНазначения.РаспаковатьТаблицуЗначений(ХранилищеДанные);
    КонецЕсли;
    
    Если ДанныеЗаполнения = Неопределено Тогда
        Возврат;
    КонецЕсли;    
	
	// Активность проводок
	Активность = ?(НаборЗаписей.Количество() > 0, НаборЗаписей[0].Активность, Истина);	
	
	Для каждого СтрокаДанные Из ДанныеЗаполнения Цикл
		
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, СтрокаДанные);
		Запись.Активность = Активность;
								
	КонецЦикла; // ЗначениеВыбора.Данные
	          
КонецПроцедуры // ЗаполнитьДвиженияХоз()

// Процедура создает документы. 
// 
// Параметры:
//  ДанныеЗаполнения - ТаблицаЗначений.
//  ОбъектСистемы    - СправочникСсылка.бит_ОбъектыСистемы.
//  РежимСообщений   - Строка.
//
// Возвращаемое значение:
//  Массив - созданные документы.
//
Функция СоздатьДокументы(ДанныеЗаполнения, ОбъектСистемы, РежимСообщений = "Ошибки") Экспорт

	НовыеДокументы = Новый Массив;

	ИмяРегистра		   = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектСистемы, "ИмяОбъекта");
	КоличествоСубконто = Метаданные.РегистрыБухгалтерии[ИмяРегистра].ПланСчетов.МаксКоличествоСубконто;
	ЭтоБюджетирование  = (ВРег(ИмяРегистра) = ВРег("бит_Бюджетирование"));
	ЭтоХозрасчетный    = (ВРег(ИмяРегистра) = ВРег("Хозрасчетный"));
	РазделительУчета   = ?(ЭтоБюджетирование, "Сценарий", "Организация");

	ШаблонПоля     = "ДанныеЗаполнения.%1 КАК %1";
	ВыраженияПолей = Новый Массив;
	Для каждого Колонка Из ДанныеЗаполнения.Колонки Цикл
		Если Колонка.Имя <> РазделительУчета 
		   И Колонка.Имя <> "Выполнять" И Колонка.Имя <> "Период" Тогда
			ВыраженияПолей.Добавить(СтрШаблон(ШаблонПоля, Колонка.Имя));
		КонецЕсли; 
	КонецЦикла;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеЗаполнения.Выполнять КАК Выполнять,
	|	ДанныеЗаполнения.Период КАК Период,
	|	&ВыраженияПолей, 
	|	&ИмяИзмерения
	|ПОМЕСТИТЬ ВременныеДанные
	|ИЗ
	|	&ДанныеЗаполнения КАК ДанныеЗаполнения
	|ГДЕ
	|	ДанныеЗаполнения.Выполнять
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеЗаполнения.Выполнять КАК Выполнять,
	|	ДанныеЗаполнения.Период КАК Период,
	|	&ВыраженияПолей,
	|	&ИмяИзмерения 
	|ИЗ
	|	ВременныеДанные КАК ДанныеЗаполнения
	|ИТОГИ ПО
	|	&ИмяИзмерения,
	|	Период";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВыраженияПолей", СтрСоединить(ВыраженияПолей, "," + Символы.ПС));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяИзмерения", 	СтрШаблон("ДанныеЗаполнения.%1", РазделительУчета));
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДанныеЗаполнения", ДанныеЗаполнения);
	Запрос.Текст = ТекстЗапроса;
	Результат	 = Запрос.Выполнить();
	
	ТаблицаДанныеЗаполнения = ДанныеЗаполнения.СкопироватьКолонки();
	
	ВыборкаИзмерение = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаИзмерение.Следующий() Цикл
	
		ВыборкаПериод = ВыборкаИзмерение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПериод.Следующий() Цикл
			 
			Если ЭтоБюджетирование Тогда
				СозданныйДокумент = Документы.бит_ОперацияБюджетирование.СоздатьДокумент();
			ИначеЕсли ЭтоХозрасчетный Тогда
				СозданныйДокумент = Документы.ОперацияБух.СоздатьДокумент();
				СозданныйДокумент.СпособЗаполнения = "Вручную";
			Иначе	
				СозданныйДокумент = Документы.бит_ОперацияУправленческий.СоздатьДокумент();
				СозданныйДокумент.РегистрБухгалтерии = ОбъектСистемы;
			КонецЕсли; 
				
			СозданныйДокумент.Дата = КонецДня(ВыборкаПериод.Период);
			
			СозданныйДокумент[РазделительУчета] = ВыборкаПериод[РазделительУчета];

			// Движения.
			ТаблицаДанныеЗаполнения.Очистить();			 
		 	Выборка = ВыборкаПериод.Выбрать();
			Пока Выборка.Следующий() Цикл
				НоваяСтрока = ТаблицаДанныеЗаполнения.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			КонецЦикла; // Выборка			
			НаборЗаписей = СозданныйДокумент.Движения[ИмяРегистра];
			НаборЗаписей.Записывать = Истина;
			ЗаполнитьДвижения(ТаблицаДанныеЗаполнения, НаборЗаписей, КоличествоСубконто);
			  
			Если ТипЗнч(СозданныйДокумент) = Тип("ДокументОбъект.ОперацияБух")
			   И ТаблицаДанныеЗаполнения.Колонки.Найти("Сумма") <> Неопределено Тогда
				// В типовом документе операция в модуле объекта нет процедуры, 
				// вычисляющей сумму операции - выполним вычисления здесь.  
				СозданныйДокумент.СуммаОперации = ТаблицаДанныеЗаполнения.Итог("Сумма");
			КонецЕсли; 
			
			Записан = бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(СозданныйДокумент, 
				РежимЗаписиДокумента.Запись, "", РежимСообщений);
			Если Записан Тогда
				НовыеДокументы.Добавить(СозданныйДокумент.Ссылка);
			КонецЕсли; 
			  
		 КонецЦикла; // ВыборкаПериод
	
	КонецЦикла; // ВыборкаИзмерение
	 
	Возврат НовыеДокументы;

КонецФункции // СоздатьДокументы()

#КонецОбласти
 
#КонецОбласти
 
#КонецЕсли
